ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкаЗаполненияФормСтатистики/НастройкаЗаполненияФормСтатистики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗаполненияФормСтатистики</name>
  <resources>
    <name>Заполнять</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Настройка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеНастройки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектНаблюдения</name>
    <type>
      <types>CatalogRef.ОбъектыСтатистическогоНаблюдения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <comment>Наименование в латинской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТранскрипции</name>
    <comment>Наименование в русской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СокращенноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/CommonModules/РегламентированнаяОтчетностьКлиентПереопределяемый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль содержит переопределяемые процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

//@skip-check module-empty-method

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции механизма расшифровки.

// Процедура выводит форму расшифровки.
//
// Параметры:
//  ИДОтчета - Строка - идентификатор отчета (совпадает с именем объекта метаданных).
//  ИДРедакцииОтчета - Строка - идентификатор редакции формы отчета (совпадает с именем формы объекта метаданных).
//  ИДИменПоказателей - Массив из Строка - массив идентификаторов имен показателей, по которым формируется расшифровка.
//  ПараметрыОтчета - Структура - структура параметров отчета, необходимых для формирования расшифровки.
// 
// Пример реализации:
//  Если ИДОтчета = "РегламентированныйОтчетБухОтчетность" Тогда
//   Если ИДРедакцииОтчета = "ФормаОтчета2011Кв1" Тогда
//    ОткрытьРасшифровкуБухОтчетностьФормаОтчета2011Кв1(ИДИменПоказателей, ПараметрыОтчета);
//   КонецЕсли;
//  КонецЕсли;
//
Процедура ОткрытьРасшифровкуОтчета(ИДОтчета, ИДРедакцииОтчета, ИДИменПоказателей, ПараметрыОтчета) Экспорт
	
	РегламентированнаяОтчетностьУПКлиент.ОткрытьРасшифровкуОтчета(ИДОтчета, ИДРедакцииОтчета, ИДИменПоказателей, ПараметрыОтчета);
	
	ЗарплатаКадрыКлиентВнутренний.ОткрытьРасшифровкуРегламентированногоОтчета(ИДОтчета, ИДРедакцииОтчета, ИДИменПоказателей, ПараметрыОтчета);
	
	
КонецПроцедуры

// Открывает форму помощника по учету НДС.
// 
// Параметры:
//  ПараметрыОткрытияПомощника - Структура
// 
Процедура ОткрытьФормуПомощникаПоУчетуНДС(ПараметрыОткрытияПомощника) Экспорт
	
КонецПроцедуры

// Выполняет действия по интерактивному заполнению лиц, ответственных за подписание статистических
// (и, возможно, других) отчетов. Вызывается из контекста формы отчета.
//
// Параметры:
//	 Параметры - Структура - структура со свойствами:
//     * Организация - СправочникСсылка.Организации - организация рег. отчета.
//	   * ОбособленноеПодразделение - СправочникСсылка.Подразделение - подразделение (если есть на форме).
//	   * ДатаПодписи - Дата - дата подписи отчета.
//	   * ИмяОбъектаМетаданных - Строка - имя метаданных отчета.
//	   * ТекущееПоле - Строка - текущее поле для настройки
//							    (ФИОПодписантСтатистика, ДолжностьПодписантСтатистика,
//								 ТелефонПодписантСтатистика, ЕмейлПодписантСтатистика).
//								Состав полей может быть расширен при необходимости.
//	  ОповещениеОбОкончании - ОписаниеОповещения - вызывается после настройки подписантов (с новыми данными).
//												   В качестве параметров передается структура,
//												   в которой могут быть свойства (состав свойств может быть
//												   расширен при необходимости):
//	    * ФИОПодписантСтатистика - Строка - ФИО подписанта.
//		* ДолжностьПодписантСтатистика - Строка - должность подписанта.
//		* ТелефонПодписантСтатистика - Строка - телефон подписанта.
//		* ЕмейлПодписантСтатистика - Строка - эл. почта подписанта.
//							
// Пример реализации:
//	 ПараметрыВыбранного = Новый Структура;
//	 ... // действия по открытию форм (например, регистра ответственных лиц)
//	 ... // получение актуальных данных (например, пользователь изменил телефон ответственного) подписантов и т.п.
//	 ... // заполнение ПараметрыВыбранного актуальными данными
//	 ВыполнитьОбработкуОповещения(ОповещениеОбОкончании, ПараметрыВыбранного);
//
Процедура ОткрытьФормуНастройкиПодписантов(Параметры, ОповещениеОбОкончании) Экспорт
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции календаря бухгалтера.

// Функция возвращает имя формы, используемой для уплаты налога.
// 
// Возвращаемое значение:
//   Строка - имя формы, используемой для уплаты налога.
//
// Пример:
//  Возврат "Документ.ПлатежноеПоручение.ФормаОбъекта";
//
Функция ИмяФормыДляУплатыНалога() Экспорт
	Возврат "Документ.СписаниеБезналичныхДенежныхСредств.ФормаОбъекта";
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции списка задач бухгалтера.

// Процедура открывает форму списка задач бухгалтера.
//
// Параметры:
//   Владелец - Форма - владелец формы.
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника организаций.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ОткрытьКалендарь(Владелец, Организация, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции интерфейса взаимодействия с конфигурациями (библиотеками)
// - потребителями.

// Процедура переопределяет создание формы РСВ-1 из списка регламентированных отчетов.
//
// Параметры:
//   ОписаниеРСВ_1 - Структура - структура с полями:
//     * Организация             - СправочникСсылка.Организации - организация;
//     * ДатаНачалаПериодаОтчета - Дата - дата начала периода отчета;
//     * ДатаКонцаПериодаОтчета  - Дата - дата конца периода отчета;
//     * КорректирующаяФорма     - Булево - признак корректирующей формы.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриСозданииРСВ_1ИзСпискаРеглОтчетов(ОписаниеРСВ_1, СтандартнаяОбработка) Экспорт
	
	ПерсонифицированныйУчетКлиент.ПриСозданииРСВ_1ИзСпискаРеглОтчетов(ОписаниеРСВ_1, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура переопределяет открытие формы РСВ-1 из журнала регламентированных отчетов.
//
// Параметры:
//   Ссылка - ДокументСсылка.РегламентированныйОтчет - ссылка на регламентированный отчет.
//   ОписаниеРСВ_1 - Структура - структура с полями:
//     * Организация             - СправочникСсылка.Организации - организация;
//     * ДатаНачалаПериодаОтчета - Дата - дата начала периода отчета;
//     * ДатаКонцаПериодаОтчета  - Дата - дата конца периода отчета;
//     * КорректирующаяФорма     - Булево - признак корректирующей формы.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриОткрытииРСВ_1ИзЖурналаРеглОтчетов(Ссылка, ОписаниеРСВ_1, СтандартнаяОбработка) Экспорт
	
	ПерсонифицированныйУчетКлиент.ПриОткрытииРСВ_1ИзСпискаРеглОтчетов(Ссылка, ОписаниеРСВ_1, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура переопределяет поведение при печати формы РСВ-1 из журнала регламентированных отчетов.
//
// Параметры:
//   Ссылка - ДокументСсылка.РегламентированныйОтчет - ссылка на регламентированный отчет.
//   ОписаниеРСВ_1 - Структура - структура с полями:
//     * Организация             - СправочникСсылка.Организации - организация;
//     * ДатаНачалаПериодаОтчета - Дата - дата начала периода отчета;
//     * ДатаКонцаПериодаОтчета  - Дата - дата конца периода отчета;
//     * КорректирующаяФорма     - Булево - признак корректирующей формы.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриПечатиРСВ_1ИзЖурналаРеглОтчетов(Ссылка, ОписаниеРСВ_1, СтандартнаяОбработка) Экспорт
	
	ПерсонифицированныйУчетКлиент.ПриПечатиРСВ_1ИзЖурналаРеглОтчетов(Ссылка, ОписаниеРСВ_1, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура переопределяет поведение при выгрузке формы РСВ-1 из журнала регламентированных отчетов.
//
// Параметры:
//   Ссылка - ДокументСсылка.РегламентированныйОтчет - ссылка на регламентированный отчет.
//   ОписаниеРСВ_1 - Структура - структура с полями:
//     * Организация             - СправочникСсылка.Организации - организация;
//     * ДатаНачалаПериодаОтчета - Дата - дата начала периода отчета;
//     * ДатаКонцаПериодаОтчета  - Дата - дата конца периода отчета;
//     * КорректирующаяФорма     - Булево - признак корректирующей формы.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриВыгрузкеРСВ_1ИзЖурналаРеглОтчетов(Ссылка, ОписаниеРСВ_1, СтандартнаяОбработка) Экспорт
	
	ПерсонифицированныйУчетКлиент.ПриВыгрузкеРСВ_1ИзЖурналаРеглОтчетов(Ссылка, ОписаниеРСВ_1, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура переопределяет поведение при проверке выгрузки формы РСВ-1 из журнала регламентированных отчетов.
//
// Параметры:
//   Ссылка        - ДокументСсылка.РегламентированныйОтчет - ссылка на регламентированный отчет.
//   ОписаниеРСВ_1 - Структура - структура с полями:
//     * Организация             - СправочникСсылка.Организации - организация;
//     * ДатаНачалаПериодаОтчета - Дата - дата начала периода отчета;
//     * ДатаКонцаПериодаОтчета  - Дата - дата конца периода отчета;
//     * КорректирующаяФорма     - Булево - признак корректирующей формы.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриПроверкеВыгрузкиРСВ_1ИзЖурналаРеглОтчетов(Ссылка, ОписаниеРСВ_1, СтандартнаяОбработка) Экспорт
	
	ПерсонифицированныйУчетКлиент.ПриПроверкеВыгрузкиРСВ_1ИзЖурналаРеглОтчетов(Ссылка, ОписаниеРСВ_1, СтандартнаяОбработка)
	
КонецПроцедуры

// Процедура открывает форму с информацией об изменениях.
//
// Параметры:
//  ИмяОтчета - Строка - имя отчета в дереве объектов метаданных;
//  ИмяФормы  - Строка - имя формы отчета;
//  Форма     - ФормаКлиентскогоПриложения - форма, из которой вызывается процедура.
//
Процедура ПредупредитьОбИзменениях(ИмяОтчета, ИмяФормы, Форма) Экспорт
	
КонецПроцедуры

// Процедура изменяет признак вывода предупреждения об изменениях.
//
// Параметры:
//  ИмяОтчета - Строка - имя отчета в дереве объектов метаданных;
//  ИмяФормы  - Строка - имя формы отчета;
//  ТребуетсяПредупредитьОбИзменениях - Булево - признак вывода предупреждения об изменениях;
//  Форма     - ФормаКлиентскогоПриложения - форма, из которой вызывается процедура.
//
Процедура ИзменитьПризнакВыводаПредупрежденияОбИзменениях(ИмяОтчета, ИмяФормы, ТребуетсяПредупредитьОбИзменениях, Форма) Экспорт
	
КонецПроцедуры

// Если требуются какие-то особые действия при открытии уведомления надо выставить СтандартнаяОбработка = Ложь
// В этом случае уведомление не создается, а требуемые действия можно проделать в процедуре ОбработчикСозданияУведомления(...)
//
// Параметры:
//   Организация          - СправочникСсылка.Организации - ссылка на элемент справочника организаций.
//   ВидУведомления       - ПеречислениеСсылка.ВидыУведомленийОСпецрежимахНалогообложения - вид уведомления.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПередОткрытиемФормыУведомления(Организация, ВидУведомления, СтандартнаяОбработка) Экспорт
	
	Если ВидУведомления =
		ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ИсчисленныеСуммыНалогов") Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// При переопределенном действии при создании уведомления здесь прописывается что именно надо сделать
//
// Параметры:
//   Форма - Форма - форма 1с-отчетности.
//   Параметр - Структура - "Организация", "ВидУведомления".
//
Процедура ОбработчикСозданияУведомления(Форма, Параметр) Экспорт
	
	Если ТипЗнч(Параметр) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ВидУведомления = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "ВидУведомления");
	
	Если ВидУведомления =
		ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ИсчисленныеСуммыНалогов") Тогда
		Параметр.Вставить("ЗначенияЗаполнения", Новый Структура("Организация", Параметр.Организация));
		ОткрытьФорму("Документ.УведомлениеОбИсчисленныхСуммахНалогов.Форма.ФормаСозданияУведомления", Параметр, Форма);
	КонецЕсли;
	
КонецПроцедуры

// Процедура уточняет данные для автозаполнения уведомления
//
// Параметры:
//   ИДОтчета             - Строка - имя отчета в дереве объектов метаданных.
//   ПараметрыОтчета      - Структура - структура обязательных параметров.
//   ФормаОтчета          - ФормаКлиентскогоПриложения - ссылка на заполняемую форму уведомления.
//   ОписаниеОповещения   - ОписаниеОповещения - процедура для продолжения процедуры автозаполнения.
//   СтандартнаяОбработка - Булево - если Истина то никакой новой информации не добавляется для автозаполнения,
//                                   необходимо продолжить автозаполнение в самой форме.
//
Процедура ПередЗаполнениемОтчета(ИДОтчета, ПараметрыОтчета, ФормаОтчета, ОписаниеОповещения, СтандартнаяОбработка = Неопределено) Экспорт
	
КонецПроцедуры

// Процедура переопределяет вывод дополнительной информации о регламентированном отчете
//
// Параметры:
//   Ссылка                    - ДокументСсылка.РегламентированныйОтчет - ссылка на регламентированный отчет.
//   ИмяФормыПодробнееОбОтчете - Строка - имя формы, которая будет открыта с параметром "Ссылка" для предоставления дополнительной информации об отчете.
//   СтандартнаяОбработка      - Булево - если Истина - будет открыта форма по имени: "Обработка.ОбщиеОбъектыРеглОтчетности.Форма." + ИмяФормыПодробнееОбОтчете;
//                                        иначе - можно выполнить свой алгоритм обработки ПодробнееОбОчете().
//
Процедура ПодробнееОбОчете(Ссылка, ИмяФормыПодробнееОбОтчете, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополняет функционал обработчика "ОбработкаОповещения" общей формы "Регламентированная отчетность",
// здесь можно добавить новую функциональность к существующей обработке оповещения.
//
// Параметры:
//  ИмяСобытия - Строка - Имя события может быть использовано для идентификации сообщений принимающими их формами.
//  Параметр   - Произвольный - Параметр сообщения. Могут быть переданы любые необходимые данные.
//  Источник   - Произвольный - Источник события. Например, в качестве источника может быть указана другая форма.
//  Форма      - ФормаКлиентскогоПриложения - Общая форма "Регламентированная отчетность".
//
// Пример:
//  Если ИмяСобытия = "Получены новые сообщения 1С-Отчетности" И Источник <> Форма Тогда
//      Оповестить("Закрыть форму новых сообщений 1С-Отчетности",, Форма);
//  КонецЕсли;
//
Процедура ФормаРегламентированнойОтчетности_ОбработкаОповещения(ИмяСобытия, Параметр, Источник, Форма) Экспорт
	
КонецПроцедуры

// Процедура открывает форму выбора кода по ОКВЭД.
//
// Параметры:
//  ВыполняемоеОповещение - ОписаниеОповещения - описание оповещения, которое будет вызвано после выполнения
//  						 данной операции.
//  						 Дополнительные параметры передаются в свойстве ДополнительныеПараметры описания оповещения -
//  						 Структура - структура с полями:
//  						   * ВариантОКВЭД - Строка - (обязателен) вариант классификатора ("ОКВЭД" или "ОКВЭД2");
//  						   * ТекущийКод - Строка - (необязателен) код по ОКВЭД (для позиционирования в списке выбора).
//  						 Возвращаемый результат выбора - Структура - структура с полями (обязательными):
//  						   * КодОКВЭД          - Строка - код по ОКВЭД;
//  						   * НаименованиеОКВЭД - Строка - наименование по ОКВЭД.
//  СтандартнаяОбработка  - Булево - признак выполнения ВыполняемоеОповещение.
//  						 Если выполняется - необходимо установить Ложь. Значение по умолчанию - Истина.
//
// Пример:
//  СтандартнаяОбработка = Ложь;
//  ПараметрыФормы = Новый Структура;
//  ПараметрыФормы.Вставить("ТипОбъекта",      "Справочник");
//  ПараметрыФормы.Вставить("НазваниеОбъекта", "Организации");
//  ПараметрыФормы.Вставить("НазваниеМакета",  ВыполняемоеОповещение.ДополнительныеПараметры.ВариантОКВЭД);
//  Если ВыполняемоеОповещение.ДополнительныеПараметры.Свойство("ТекущийКод") Тогда
//  	ПараметрыФормы.Вставить("ТекущийКод", ВыполняемоеОповещение.ДополнительныеПараметры.ТекущийКод);
//  КонецЕсли;
//  ПараметрыФормы.Вставить("ТекущийПериод", ТекущаяДата());
//  ПараметрыФормы.Вставить("Комментарий",   "");
//  ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораКодаПоОКВЭДЗавершение",
//  ОбщегоНазначенияКлиент.ОбщийМодуль("РегламентированнаяОтчетностьКлиентПереопределяемый"),
//  ВыполняемоеОповещение);
//  ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,, ОписаниеОповещения);
//
// Пример процедуры "ОткрытьФормуВыбораКодаПоОКВЭДЗавершение" (служебного интерфейса):
//  Процедура ОткрытьФормуВыбораКодаПоОКВЭДЗавершение(РезультатВыбора, ВыполняемоеОповещение) Экспорт
//  	Если ТипЗнч(РезультатВыбора) = Тип("Строка") Тогда
//  		ОКВЭД = ОбщегоНазначенияБПВызовСервера.ПолучитьКлассификатор(
//  		ВыполняемоеОповещение.ДополнительныеПараметры.ВариантОКВЭД);
//  		ВозвращаемыйРезультат = Новый Структура(
//  		"КодОКВЭД, НаименованиеОКВЭД", РезультатВыбора, ОКВЭД.Получить(РезультатВыбора));
//  		ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, ВозвращаемыйРезультат);
//  	КонецЕсли;
//  КонецПроцедуры
//
Процедура ОткрытьФормуВыбораКодаПоОКВЭД(ВыполняемоеОповещение, СтандартнаяОбработка = Истина) Экспорт
	
КонецПроцедуры

// Процедура открывает форму для заполнения регистрирующего органа организации.
//
// Параметры:
//  Организация           - СправочникСсылка.Организации - ссылка на элемент справочника организаций.
//  ВыполняемоеОповещение - ОписаниеОповещения - описание оповещения, которое будет вызвано после выполнения
//                          данной операции.
//
// Пример:
//  ПараметрыФормы = Новый Структура;
//  ПараметрыФормы.Вставить("Ключ", Организация);
//  ОткрытьФорму("Справочник.Организации.Форма.ФормаОрганизации", ПараметрыФормы,,,,, ВыполняемоеОповещение);
//
Процедура ОткрытьФормуДляЗаполненияРегистрирующегоОргана(Организация, ВыполняемоеОповещение) Экспорт
	
	ПараметрыФормы = Новый Структура("Ключ", Организация);
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы,,,,, ВыполняемоеОповещение);
	
КонецПроцедуры

// Процедура открывает форму настроек непосредственно перед автозаполнением регламентированного отчета
// (например, сразу после нажатия кнопки "Заполнить" в форме регламентированного отчета), если в последнем
// поддерживается такая возможность.
//
// Параметры:
//  ВыполняемоеОповещение - ОписаниеОповещения - описание оповещения, которое будет вызвано после выполнения
//                          данной операции.
//                          Параметры передаются в свойстве ДополнительныеПараметры описания оповещения -
//                          Структура - структура с проивольными полями, позволяющими идентифицировать отчет.
//                          Возвращаемый результат - Структура - структура с полями (обязательно одно из полей):
//                            * НастройкиАвтозаполнения - Структура - параметы автозаполнения, которые будут переданы
//                                                        в свойстве "НастройкиАвтозаполнения" параметров отчета
//                                                        процедуры "ЗаполнитьОтчет" общего модуля
//                                                        "РегламентированнаяОтчетностьПереопределяемый";
//                            * ТекстПриОтказе - Строка - текст для выдачи предупреждения и прерывания автозаполнения.
//
// Пример (перед автозаполнением отчета "РегламентированныйОтчетДвижениеСредствПоСчетуВБанкеЗаПределамиРФ"):
//  ПараметрыОповещения = Новый Структура;
//  ПараметрыОповещения.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
//  ОповещениеОВыборе = Новый ОписаниеОповещения("ОткрытьФормуВыбораСчетаЗавершение", ЭтотОбъект, ПараметрыОповещения);
//  ДополнительныеПараметры = ВыполняемоеОповещение.ДополнительныеПараметры;
//  Организация = ДополнительныеПараметры.Организация;
//  СписокИностранныхБанков = УчетДенежныхСредствВызовСервера.СписокИностранныхБанков();
//  НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
//  ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//  ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Банк");
//  ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
//  ЭлементОтбора.Использование  = Истина;
//  ЭлементОтбора.ПравоеЗначение = СписокИностранныхБанков;
//  ПараметрыОтбора = Новый Структура;
//  ПараметрыОтбора.Вставить("Владелец", Организация);
//  ПараметрыФормы = Новый Структура;
//  ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
//  ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
//  ПараметрыФормы.Вставить("РежимВыбора", Истина);
//  ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы,,,,, ОповещениеОВыборе);
//
Процедура ОткрытьФормуНастроекПередАвтозаполнениемРеглОтчета(ВыполняемоеОповещение) Экспорт
	
КонецПроцедуры

// Процедура дополняет перечень форм, в которые дополнительно встроены функции отправки регламентированной отчетности.
//
// Параметры:
//  ИменаФорм - Массив из Строка - список имен форм
//
Процедура ДобавитьПрикладныеФормыОтправкаОтчетов(ИменаФорм) Экспорт
	
КонецПроцедуры

// Процедура открывает форму помощника уплаты налога для заполнения регламентированного отчета "Налог на прибыль".
//
// Параметры:
//  Организация      - СправочникСсылка.Организации - организация
//  ДатаКонцаПериода - Дата - дата конца периода отчета
//  ПараметрыПравила - Структура - параметры правила для списка задач бухгалтера
//
Процедура ОткрытьФормуПомощникаУплатыНалога(Организация, ДатаКонцаПериода, ПараметрыПравила) Экспорт
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции.

// Процедура вызывается в формах отчета "РегламентированныйОтчетРСВ1"
// при нажатии кнопки перехода в специализированное рабочее место подготовки
// отчетности в ПФР.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника организаций.
//   ДатаНачалаПериодаОтчета - Дата - дата начала периода отчета.
//   ДатаКонцаПериодаОтчета - Дата - дата конца периода отчета.
//
Процедура ПерейтиВРабочееМестоПФР(Организация, ДатаНачалаПериодаОтчета, ДатаКонцаПериодаОтчета) Экспорт
	ЗарплатаКадрыКлиент.ПерейтиВРабочееМестоПодготовкиКвартальнойОтчетностиПФР(Организация, ДатаНачалаПериодаОтчета);	
КонецПроцедуры

// Процедура выполняет назначаемую команду формы.
//
// Параметры:
//   Форма - Форма - форма, из которой вызвана команда.
//
Процедура ВыполнитьНазначаемуюКомандуНаКлиенте(Форма) Экспорт
	
КонецПроцедуры

// Процедура выполняет назначаемую команду формы "РегламентированнаяОтчетность".
//
// Параметры:
//   Форма   - Форма - форма, из которой вызвана команда.
//   Команда - КомандаФормы - назначенная команда формы.
//
// Пример:
//   Если Команда.Имя = "ОтчетыПоказатьДополнительнуюИнформацию" Тогда
//   	ПоказатьПредупреждение(, "Заполните обработчик команды """ + Команда.Имя + """");
//   КонецЕсли;
//
Процедура ФормаРегламентированнойОтчетности_ВыполнитьНазначаемуюКомандуНаКлиенте(Форма, Команда) Экспорт
	
КонецПроцедуры

// Процедура переопределяет имя формы выбора периода для установки отбора в форме "1С Отчетность".
//
// Параметры:
//  ПолноеИмяФормыВыбораПериода  - Строка - Полный путь к форме выбора периода.
//
// Пример:
//  ПолноеИмяФормыВыбораПериода = "ОбщаяФорма.ВыборПроизвольногоПериода";
//
Процедура ФормаРегламентированнойОтчетности_ИмяФормыВыбораПериода(ПолноеИмяФормыВыбораПериода) Экспорт
	
КонецПроцедуры

// Процедура переопределяет имя и параметры открытия формы выбора отчета для установки отбора в форме "1С Отчетность".
//
// Параметры:
//  ПолноеИмяФормыВыбораВидаОтчета - Строка - Полный путь к форме выбора вида отчета.
//  ПараметрыФормыВыбораВидаОтчета - Структура - Параметры открытия формы выбора вида отчета.
//
// Пример:
//  ПолноеИмяФормыВыбораВидаОтчета = "ОбщаяФорма.ФормаПодбораЗначенийВСписок";
//
Процедура ФормаРегламентированнойОтчетности_ОпределениеФормыВыбораВидаОтчета(ПолноеИмяФормыВыбораВидаОтчета,
																			 ПараметрыФормыВыбораВидаОтчета) Экспорт
	
КонецПроцедуры

// Процедура проверяет, выполнялась ли ранее настройка автозаполнения.
//
// Параметры:
//   ПараметрыОтчета       - Структура - параметры регл. отчета.
//   ВыполняемоеОповещение - ОписаниеОповещения - Описание оповещения, которое будет вызвано после выполнения данной
//											 	  операции. В качестве результата описания оповещения должно
//												  передаваться булево значение, от которого зависит будет ли выполнятся
//												  дальнейший код в процедуре, которая вызвала этот метод.
//   СтандартнаяОбработка  - Булево - по умолчанию Истина. Если потребитель будет совершать какие-то действия
//														   с последующим выполнением ОписаниеОповещения необходимо
//														   выставить флажок в Ложь.
//
Процедура ПроверитьНастройкиАвтозаполненияОтчета(ПараметрыОтчета, ВыполняемоеОповещение, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИмяОтчета   = ПараметрыОтчета.ИДОтчета;
	ИмяФормы    = ПараметрыОтчета.ИДРедакцииОтчета;
	Организация = ПараметрыОтчета.Организация;
	
	РезультатПроверки = ЗаполнениеФормСтатистикиВызовСервера.ПроверитьНастройкиЗаполненияОтчета(ИмяОтчета, ИмяФормы, Организация);
	
	Если РезультатПроверки = Неопределено Тогда
		// У пользователя нет прав на редактирование настроек.
		// Поэтому предложить ему ничего не можем.
		// Либо настройка формы не предусмотрена.
		ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Истина);
		// Обработка оповещения более не требуется
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ФормаСтатистики 			= РезультатПроверки.ФормаСтатистики;
	ВыполнялисьНастройкиФормы 	= РезультатПроверки.ВыполнялисьНастройкиФормы;
	
	Если Не ВыполнялисьНастройкиФормы Тогда
		
		Кнопки = Новый СписокЗначений();
		
		Кнопки.Добавить(КодВозвратаДиалога.Да, 		"Открыть настройки");
		Кнопки.Добавить(КодВозвратаДиалога.Нет, 	"Заполнить");
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	"Отмена");
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
		ДополнительныеПараметры.Вставить("Организация", Организация);
		ДополнительныеПараметры.Вставить("ФормаСтатистики", ФормаСтатистики);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьНастройкиЗаполненияОтчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = "Перед заполнением этой формы рекомендуем проверить настройки заполнения
			|";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура открывает форму настройки автозаполнения.
//
// Параметры:
//   ПараметрыФормы - Структура - параметры настройки автозаполнения формы.
//
Процедура ОткрытьФормуНастройкиАвтозаполнения(ПараметрыФормы) Экспорт
	
	Перем ИмяОтчета, ИмяФормы, ИмяПоля, Организация, ДатаНачала, ДатаОкончания;
	
	ПараметрыФормы.Свойство("ИДОтчета",             ИмяОтчета);
	ПараметрыФормы.Свойство("ИДРедакцииОтчета",     ИмяФормы);
	ПараметрыФормы.Свойство("ИДТекущегоПоказателя", ИмяПоля); // Может не передаваться или передаваться Неопределено, если пользователь хочет выполнить настройку для всей формы
	ПараметрыФормы.Свойство("Организация",          Организация);
	ПараметрыФормы.Свойство("ДатаНачала",           ДатаНачала);
	ПараметрыФормы.Свойство("ДатаОкончания",        ДатаОкончания);
	
	ОписаниеФормы = ЗаполнениеФормСтатистикиВызовСервера.ОписаниеФормыНастройкиПоля(
		ИмяОтчета, ИмяФормы, ИмяПоля, Организация, ДатаНачала, ДатаОкончания);
		
	Если ТипЗнч(ОписаниеФормы) = Тип("Строка") Тогда
		
		ПоказатьПредупреждение(,ОписаниеФормы);
		
	Иначе
		
		ОткрытьФорму(ОписаниеФормы.ИмяФормы, ОписаниеФормы.ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура реализует печать объектов, отображаемых на закладке Отчеты и Уведомления формы Отчетность.
//
// Параметры:
//	 Ссылка - СправочникСсылка, ДокументСсылка - ссылка на объект, который необходимо напечатать.
//                                        		 Если для данного объекта печать невозможна,
//                                               нужно выдавать соотвествующее предупрежедние.
//	 ИмяМакетаДляПечати - Строка - имя макета для печати, при использовании которого необходимо распечатать объект.
//		                           Если ИмяМакетаДляПечати пустое, то для печати использовать основной макет.
// 	 СтандартнаяОбработка - Булево - если СтандартнаяОбработка = Истина, то будет выполнена печать с помощью подсистемы печати из БСП.
//
Процедура Печать(Ссылка, ИмяМакетаДляПечати, СтандартнаяОбработка) Экспорт
	РегламентированнаяОтчетностьУПКлиент.ПечатьРегламентированногоОтчета(Ссылка, ИмяМакетаДляПечати, СтандартнаяОбработка);
	ЗарплатаКадрыКлиент.ПечатьДокументаОтчетности(Ссылка, ИмяМакетаДляПечати, СтандартнаяОбработка);		
КонецПроцедуры

// Процедура реализует выгрузку объектов, отображаемых на закладке Отчеты и Уведомления формы Отчетность.
// Параметры:
//	 Ссылка - СправочникСсылка, ДокументСсылка - ссылка на объект, который необходимо выгрузить.
//                                               Если для данного объекта выгрузка невозможна,
//                                               нужно выдавать соответствующее предупреждение.
//	 УникальныйИдентификаторФормы - УникальныйИдентификатор - уникальный идентификатор вызывающей формы ("1С-Отчетность").
//
Процедура Выгрузить(Ссылка, УникальныйИдентификаторФормы = Неопределено) Экспорт
	РегламентированнаяОтчетностьУПКлиент.ВыгрузкаРегламентированногоОтчета(Ссылка);
	// ЗарплатаКадрыПодсистемы
	ЗарплатаКадрыКлиент.ВыгрузитьДокументОтчетности(Ссылка, УникальныйИдентификаторФормы);
	// Конец ЗарплатаКадрыПодсистемы
КонецПроцедуры

// Процедура реализует создание объектов, отображаемых на закладке Уведомления и Отчетность формы Отчетность, не входящие в состав БРО.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - организация, по которой нужно создать объект.
//  Тип - Тип - тип объекта, который необходимо создать.
//  СтандартнаяОбработка - Булево - если СтандартнаяОбработка = Истина, то будет выполнено создание объекта стандартным образом.
//
Процедура СоздатьНовыйОбъект(Организация, Тип, СтандартнаяОбработка) Экспорт
	РегламентированнаяОтчетностьУПКлиент.СозданиеРегламентированногоОтчета(Организация, Тип, СтандартнаяОбработка);
	ЗарплатаКадрыКлиент.СоздатьНовыйДокументОтчетности(Организация, Тип, СтандартнаяОбработка);	
КонецПроцедуры

// Процедура открывает окно выбора обособленных подразделений в случае, когда стандартный механизм 
// по каким-либо причинам не может быть использован.
// Вызывается из форм статистики (ЗП-*, П-4 и некоторых других).
// В качестве callback-процедуры следует использовать РегламентированнаяОтчетностьКлиент.ОбработкаВыбораОбособленногоПодразделения.
//
// Параметры:
//   Форма - Форма - форма отчета откуда открывается выбор подразделения.
//   СтандартнаяОбработка - Булево - если отработано необходимо выставить СтандартнаяОбработка = Ложь.
//
// Пример для ЗУП 3.0 КОРП:
//   Там форма выбора это форма списка с параметром открытия РежимВыбора = Истина
//   СтандартнаяОбработка = Ложь;
//   Отбор = Новый Структура("Владелец, ИмеетНомерТерриториальногоОрганаРосстата", Форма.СтруктураРеквизитовФормы.Организация, Истина);
//   Параметры = Новый Структура("Отбор, РежимВыбора", Отбор, Истина);
//   ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаВыбораОбособленногоПодразделения", РегламентированнаяОтчетностьКлиент, Новый Структура("Форма", Форма));
//   ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаВыбора",Параметры,Форма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//
Процедура ОбработкаВыбораПоляОбособленныхПодразделений(Форма, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Процедура определяет, открывать или нет из формы "1С-Отчетность" файлы, присоединенные к объекту.
//
// Параметры:
//  ПараметрыПроверки - Структура:
//   "Владелец"             - СправочникСсылка, ДокументСсылка - ссылка на объект;
//   "ТекстПредупреждения"  - Строка - если заполнен и СтандартнаяОбработка = Ложь, то будет выведено предупреждение;
//   "СтандартнаяОбработка" - Булево - если Ложь, открытие присоединенных файлов не выполняется.
//
// Пример:
//  Если ТипЗнч(ПараметрыПроверки.Владелец) = Тип("СправочникСсылка.МакетыПенсионныхДел") Тогда
//  	
//  	ПараметрыПроверки.СтандартнаяОбработка = Ложь;
//  	
//  	ПараметрыПроверки.ТекстПредупреждения = НСтр(
//  	"ru='Присоединение файлов к ""Макетам пенсионных дел"" из списка отчетов не предусмотрено'");
//  	
//  КонецЕсли;
//
Процедура ПроверитьВладельцаПриОткрытииПрисоединенныхФайловИзСпискаОтчетов(ПараметрыПроверки) Экспорт
	ЗарплатаКадрыКлиент.ПроверитьВладельцаПриОткрытииПрисоединенныхФайловИзСпискаОтчетов(ПараметрыПроверки);
КонецПроцедуры

// Открывает форму закрытия месяца.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//  ПериодРегистрации - Дата - закрываемый период.
//
// Пример реализации:
//  ПараметрыФормы = Новый Структура;
//  ПараметрыФормы.Вставить("Организация", Организация);
//  ПараметрыФормы.Вставить("ПериодРегистрации", ПериодРегистрации);
//  ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.Форма", ПараметрыФормы, ЭтотОбъект);
//
Процедура ОткрытьФормуЗакрытияМесяца(Организация, ПериодРегистрации) Экспорт
	
КонецПроцедуры

#Область МеханизмТарификации

// Проверяет возможность автоматического заполнения регламентированного отчета по данным ИБ конфигурации.
//
// Параметры:
//  ИмяФормы - Строка - имя формы регламентированного отчета;
//  Отказ - Булево - признак отказа от автозаполнения регл. отчета.
//
// Пример реализации:
//  Если НЕ ТарификацияБПВызовСервераПовтИсп.РазрешенУчетРегулярнойДеятельности() Тогда
//  	ТарификацияБПКлиент.ОповеститьОбОграниченииТарифа(ИмяФормы + ".ЗаполнитьАвто");
//      Отказ = Истина;
//  КонецЕсли;
//
Процедура ПроверитьВозможностьАвтоЗаполненияРеглОтчета(ИмяФормы, Отказ) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Открывает форму для интерактивного выбора контрактов и дальнейшего помещения по адресу во временном хранилище
// коллекции реквизитов, идентифицирующих контракты, используемой для выборочного заполнения отчета
// "РегламентированныйОтчетИсполнениеКонтрактовГОЗ".
//
// Параметры:
//  СтруктураПараметров - Структура:
//   * Организация                        - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   * ДатаСоставленияОтчета              - Дата - дата составления отчета "РегламентированныйОтчетИсполнениеКонтрактовГОЗ".
//   * АдресВоВременномХранилищеКонтракты - Строка - адрес во временном хранилище, по которому надо поместить коллекцию
//                                       (возможны типы значений коллекции: Массив, ТаблицаЗначений, ДеревоЗначений,
//                                       Структура) реквизитов, идентифицирующих контракты (возможны простые типы
//                                       значений реквизитов).
//
// Пример реализации:
//  ОткрытьФорму("Отчет.ИсполнениеКонтрактовГОЗ.Форма.ФормаВыбораКонтрактов", СтруктураПараметров);
//
Процедура ОткрытьФормуВыбораСпискаКонтрактов(СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.Свойство("ПараметрыОткрытия") Тогда
		
		ПараметрыОткрытия = СтруктураПараметров.ПараметрыОткрытия;
		СтруктураПараметров.Удалить("ПараметрыОткрытия");
	
		ОткрытьФорму("Отчет.ИсполнениеКонтрактовГОЗ.Форма.ФормаВыбораКонтрактов", СтруктураПараметров, ПараметрыОткрытия.ВладелецФормы, , , , ПараметрыОткрытия.ОповещениеОВыборе);
		
	Иначе
		
		ОткрытьФорму("Отчет.ИсполнениеКонтрактовГОЗ.Форма.ФормаВыбораКонтрактов", СтруктураПараметров);
		 
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму подбора номерклатуры, возвращает запрашиваемый список параметров
//
// Параметры:
//  СтандартнаяОбработка - Булево -необходимо установить Истина, если потребитель будет реализовывать данный функционал
//  ОповещениеОЗакрытии - ОписаниеОповещения - оповещение, выполняемое после подбора
//  Владелец - ФормаКлиентскогоПриложения - рег.отчет/уведомление, открывающее подбор номенклатуры
//  ЗапрашиваемыеПоказатели - Строка - через запятую перечисляются запрашиваемые параметры
Процедура ОткрытьФормуПодбораНоменклатуры(СтандартнаяОбработка, ОповещениеОЗакрытии, Владелец, ЗапрашиваемыеПоказатели) Экспорт
	
КонецПроцедуры

// Процедура открывает форму распределения выручки по ОКВЭД.
// Вызывается из форм статистики.
//
// Параметры:
//   ПараметрыФормы - Структура - содержит параметры для открытия формы
//   Форма - ФормаКлиентскогоПриложения - форма отчета
//   ОбработчикЗавершения - ОписаниеОповещения - оповещение, выполняемое после распределения выручки по ОКВЭД
//
Процедура ОбработкаВыбораРаспределитьВыручкуПоОКВЭД(ПараметрыФормы, Форма, ОбработчикЗавершения) Экспорт
	
	ЗаполнениеФормСтатистикиКлиент.РаспределитьВыручкуПоОКВЭД(ПараметрыФормы, Форма, ОбработчикЗавершения);
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. Процедура проверяет, выполнялась ли ранее настройка автозаполнения.
//
// Параметры:
//   ПараметрыОтчета       - Структура - параметры регл. отчета.
//   ВыполняемоеОповещение - ОписаниеОповещения - Описание оповещения, которое будет вызвано после выполнения данной операции.
//                                                В качестве результата описания оповещения должно передаваться булево значение,
//												  от которого зависит будет ли выполнятся дальнейший код в процедуре,
//												  которая вызвала этот метод.
//
Процедура ПроверитьНастройкиЗаполненияОтчета(ПараметрыОтчета, ВыполняемоеОповещение) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СверкаСчетовФактурВДекларацииПоНДС

// Проверяется необходимо ли выполнять сверку счетов-фактур в декларации,
// заполняются параметры выводимого баннера, если 1С:Сверка 2.0 не подключена
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма декларации
//  ИмяОтчета - Строка - передается значение "Декларация"
//
Процедура СверкаДекларацииНДСПриОткрытииОтчета(Форма, ИмяОтчета) Экспорт
	
КонецПроцедуры

// Выполняется сверка счетов-фактур в декларации
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма декларации
//
Процедура СверитьДекларациюПоНДС(Форма) Экспорт
	
КонецПроцедуры

// Если в организации не подключена сверка, из баннера будет открываться форму подключения сверки
// 
Процедура ОткрытьФормуПодключенияКСверке() Экспорт
	
КонецПроцедуры

// Открывается форма с детальными результатами сверки
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма декларации
//
Процедура ОткрытьОтчетПоРасхождениямВСверке(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму выбора контрагента.
//
// Параметры:
//  Владелец - ФормаКлиентскогоПриложения - форма, в которой осуществляется выбор контрагента;
//  ВыполняемоеОповещение - ОписаниеОповещения - описание оповещения, которое будет вызвано после завершения
//   работы с формой выбора.
//
// Пример реализации:
//  ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ,
//   Владелец, , , , ВыполняемоеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//
Процедура ОткрытьФормуВыбораКонтрагента(Владелец, ВыполняемоеОповещение) Экспорт
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ,
		Владелец, , , , ВыполняемоеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Открывает замещающую форму отчета и устанавливает признак существования такой формы.
// Реализует переопределяемое поведение процедуры см. РегламентированнаяОтчетностьКлиент.ОткрытьЗамещающуюФормуОтчета
// 
// Параметры:
//  ИмяОтчета - Строка
//  ПараметрыОткрытия - Структура - параметры, необходимые для открытия замещающей формы
//  ЕстьЗамещающаяФорма - Булево - переменную необходимо установить в значение Истина,
//   если реализовано переопределение. В противном случае будет вызван обработчик
//   отсутствия переопределения в замещаемой форме.
// 
// Пример реализации:
// Если ИмяОтчета = "РегламентированныйОтчетРасчетЧистыхАктивов" Тогда
//  ЕстьЗамещающаяФорма = Истина;
//  Организация = ПараметрыОткрытия.Организация;
//  Период = ПараметрыОткрытия.КонецПериода;
//  Уникальность = Новый УникальныйИдентификатор;
//  РасчетСтоимостиЧистыхАктивовКлиент.ОткрытьПоДаннымУчета(Организация, Период, Уникальность);
// КонецЕсли;
//
Процедура ПриОткрытииЗамещающейФормыОтчета(ИмяОтчета, ПараметрыОткрытия, ЕстьЗамещающаяФорма) Экспорт
	
КонецПроцедуры

// Процедура завершения проверки настройки заполнения статистических отчетов
// Вызывается если задан вопрос, про проверку настроек заполнения.
//
Процедура ПроверитьНастройкиЗаполненияОтчетаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Организация = ДополнительныеПараметры.Организация;
	ФормаСтатистики = ДополнительныеПараметры.ФормаСтатистики;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Организация);
		ПараметрыФормы.Вставить("ФормаСтатистики", ФормаСтатистики);
		ОткрытьФорму("РегистрСведений.НастройкаЗаполненияФормСтатистики.Форма.НастройкаЗаполненияФормСтатистики", ПараметрыФормы);
		Результат = Ложь;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ЗаполнениеФормСтатистикиВызовСервера.ЗаписатьНастройкиВыполнены(ФормаСтатистики, Организация);
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Результат);
	
КонецПроцедуры

#КонецОбласти
